ILFforever/F.L.A.M.E./src/MQ2-Full-ESP32.cpp
        if (PAData.length() == 0)
        { // PA now empty
          digitalWrite(RelaySW, LOW);
          StartPA = false;
          pa.remove(pa(0)); // delete
          if (SerialDebug)
          {
            Serial.println("PA empty delete dict");
          }
        }
      }
    }
    else if (SamDict.count() > 0)
    {
      ESP8266SAM *sam = new ESP8266SAM;
      String SamData = SamDict[0];
      String SamStatus = String(SamData[SamData.length() - 1]);
      unsigned int Delnumber = SamData.length() - 1;
      String SamRoom = SamData;
      SamRoom.remove(Delnumber, 1);
      if (SerialDebug)
      {
        Serial.print("SamData = " + SamData);
        Serial.print(" : SamStatus = " + SamStatus + "\n");
        Serial.print("SamRoom = " + SamRoom);
      }
      digitalWrite(RelaySW, HIGH);
      if (SamStatus == "1")
      { // Room is on fire
        sam->Say(out, "New fire reported in room ");
        const char *VoiceChar = SamRoom.c_str();
        sam->Say(out, VoiceChar);
      }
      else if (SamStatus == "0")
      {
        sam->Say(out, "Fire Stopped in room ");
        const char *Voice2Char = SamRoom.c_str();
        sam->Say(out, Voice2Char);
      }
      digitalWrite(RelaySW, LOW);
      SamDict.remove(SamDict(0));
      delete sam;
    }
    else if (ovr_Status)
    {
      if (OVRTick < 5)
      {
        OVRTick++;
      }
      else
      {
        digitalWrite(RelaySW, HIGH);
        ESP8266SAM *sam = new ESP8266SAM;
        sam->Say(out, "There are currently ");
        String RoomTreshStr = String(d.count());
        const char *TreshChar = RoomTreshStr.c_str();
        sam->Say(out, TreshChar);
        sam->Say(out, "Rooms on fire");
        digitalWrite(RelaySW, LOW);
        delete sam;
        OVRTick = 0;
      }
    }
    else
    {
      if (LastTick == 0)
      {
        LastTick = millis();
      }
      if (millis() - LastTick > SecondInterval * 1000)
      {
        if (SerialDebug)
        {
          Serial.print("Number of rooms on fire =");
          Serial.println(d.count());
        }
        Tick += 1;
        LastTick = millis();
        if (p.count() > 0)
        { // if there is Room on Fire
          digitalWrite(RelaySW, HIGH);
          ESP8266SAM *sam = new ESP8266SAM;
          sam->Say(out, "Room ");
          if (CurrentRoom + 1 <= d.count())
          {
            SayOut();
            CurrentRoom++;
          }
          else
          {
            CurrentRoom = 0; // cycle send
            SayOut();
            CurrentRoom++;
          }
          digitalWrite(RelaySW, HIGH);
          sam->Say(out, " is still on fire!");
          delay(150);
          digitalWrite(RelaySW, LOW);
        }
      }
    }
    delay(100);
  }
}

void SayOut()
{
  digitalWrite(RelaySW, HIGH);
  ESP8266SAM *sam = new ESP8266SAM;
  String RoomCycle = p(CurrentRoom);
  const char *RoomCycleChar = RoomCycle.c_str();
  sam->Say(out, RoomCycleChar);

  // Serial.print("SamSayOut Room" + String(p(CurrentRoom)) + " is still on fire");
  delay(150);
  digitalWrite(RelaySW, LOW);
  delete sam;
}

void Beep()
{
  if (BuzzerON == false)
  {
    digitalWrite(buzpin, HIGH);
    BuzzerON = true;
  }
  else
  {
    digitalWrite(buzpin, LOW);
    BuzzerON = false;
    taskBeep.disable();
  }
}

void BuzzerAlert102()
{
  if (SerialDebug)
  {
    Serial.println("BEEPING");
  }
  taskBeep.enable();
}
void BuzzerAlert104()
{
  taskBeep.enable();
}
void BuzzerAlert1010()
{
  taskBeep.enable();
}

void Firedetect()
{
  ReadSensor();
  CODif12 = CO1 - CO2;
  CODif13 = CO1 - CO3;
  CODif23 = CO2 - CO3;
  SMDif12 = Smoke1 - Smoke2;
  SMDif13 = Smoke1 - Smoke3;
  SMDif23 = Smoke2 - Smoke3;
  Dif12 = true;
  Dif13 = true;
  Dif23 = true;
  COClean(); // clean up data
  Dif12 = true;
  Dif13 = true;
  Dif23 = true;
  SMClean(); // clean up data
  if (SMError || COError)
  { // if any error
    doc["ERROR"] = "1";
  }
  else
  {
    doc["ERROR"] = "0";
  }
  if (detectionTimes <= 5)
  { // เก็บข้อมูล
    SumCo = SumCo + CO;
    SumSm = SumSm + SM;
    detectionTimes++;
  }
  else
  {
    detectionTimes = 1;
    unsigned int FinalCO = SumCo / 5;
    unsigned int FinalSM = SumSm / 5;
    SumCo = 0;
    SumSm = 0;
    if (SerialDebug)
    {
      Serial.print("FinalCO = ");
      Serial.println(FinalCO);
      Serial.print("FinalSM = ");
      Serial.println(FinalSM);
    }
    if ((FinalCO >= COTreshold) && (FinalSM >= SMTreshold))
    { // both more than treshold
      if (ovr_Status == false)
      {
        if (OneOTwo == false)
        { // want this
          taskBuzzer102.enable();
          // Serial.println("taskBuzzer102.enable()");
          OneOTwo = true;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == true)
        {
          taskBuzzer1010.disable();
          OneOTen = false;
        }
        Buzlevel = 3;
      }
      if (SerialDebug)
        Serial.println("Both more than treshold");
      Onfire = true;
    }
    else if ((FinalCO >= COTreshold) && (FinalSM >= SMTreshold / 2))
    { // Co more than treshold, smoke more than half
      if (ovr_Status == false)
      {
        if (OneOTwo == false)
        { // want this
          taskBuzzer102.enable();
          // Serial.println("taskBuzzer102.enable()");
          OneOTwo = true;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == true)
        {
          taskBuzzer1010.disable();
          OneOTen = false;
        }
        Buzlevel = 3;
      }
      if (SerialDebug)
        Serial.println("Co more than treshold, smoke more than half");
      Onfire = true;
    }
    else if ((FinalSM >= SMTreshold) && (FinalCO >= COTreshold / 2))
    { // Smoke more than treshold, Co more than half
      if (ovr_Status == false)
      {
        if (OneOTwo == false)
        { // want this
          taskBuzzer102.enable();
          // Serial.println("taskBuzzer102.enable()");
          OneOTwo = true;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == true)
        {
          taskBuzzer1010.disable();
          OneOTen = false;
        }
        Buzlevel = 3;
      }
      if (SerialDebug)
        Serial.println("Smoke more than treshold, Co more than half");
      Onfire = true;
    }
    else if ((FinalCO >= COTreshold / 2) && (FinalSM >= SMTreshold / 2))
    { // both more than half
      if (ovr_Status == false)
      {
        if (OneOTwo == true)
        {
          taskBuzzer102.disable();
          OneOTwo = false;
        }
        if (OneOFour == false)
        { // want this
          taskBuzzer104.enable();
          // Serial.println("taskBuzzer104.enable()");
          OneOFour = true;
        }
        if (OneOTen == true)
        {
          taskBuzzer1010.disable();
          OneOTen = false;
        }
        Buzlevel = 2;
      }
      if (SerialDebug)
        Serial.println("both more than half");
      Onfire = false;
    }
    else if ((FinalCO >= COTreshold / 2) && (FinalSM < SMTreshold / 2))
    { // CO more than half Sm less than half
      if (ovr_Status == false)
      {
        if (OneOTwo == true)
        {
          taskBuzzer102.disable();
          OneOTwo = false;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == false)
        { // want this
          taskBuzzer1010.enable();
          OneOTen = true;
        }
        Buzlevel = 1;
      }
      if (SerialDebug)
        Serial.println("CO more than half Sm less than half");
      Onfire = false;
    }
    else if ((FinalCO < COTreshold / 2) && (FinalSM >= SMTreshold / 2))
    { // SM more than half Co less than half
      if (ovr_Status == false)
      {
        if (OneOTwo == true)
        {
          taskBuzzer102.disable();
          OneOTwo = false;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == false)
        { // want this
          taskBuzzer1010.enable();
          OneOTen = true;
        }
        Buzlevel = 1;
      }
      if (SerialDebug)
      {
        Serial.println("CO more than half Sm less than half");
        Serial.println("SM more than half Co less than half");
      }

      Onfire = false;
    }
    else if ((FinalCO < COTreshold / 2) && (FinalSM < SMTreshold / 2))
    { // Both less than half
      if (ovr_Status == false)
      {
        if (OneOTwo == true)
        {
          taskBuzzer102.disable();
          OneOTwo = false;
        }
        if (OneOFour == true)
        {
          taskBuzzer104.disable();
          OneOFour = false;
        }
        if (OneOTen == true)
        {
          taskBuzzer1010.disable();
          OneOTen = false;
        }
        Buzlevel = 0;
      }
      if (SerialDebug)
        Serial.println("Both less than half");
      Onfire = false;
    }
  }
  if (Onfire == true)
  { // address data to send
    doc["status"] = "1";
  }
  else
  {
    doc["status"] = "0";
  }
}

void SMClean()
{
  if (abs(SMDif12) >= DifTresholdSM)
  {
    Dif12 = false;
  }
  if (abs(SMDif13) >= DifTresholdSM)
  {
    Dif13 = false;
  }
  if (abs(SMDif23) >= DifTresholdSM)
  {
    Dif23 = false;
  }
  if (Dif12 == true && Dif13 == true && Dif23 == true)
  {
    SM = ((Smoke1 + Smoke2 + Smoke3) / 3);
    if (SerialDebug)
      Serial.println("SM All sensor read");
    OldSM = SM;
  }
  else if (Dif12 == true && Dif13 == false && Dif23 == false)
  {
    SM = ((Smoke1 + Smoke2) / 2);
    if (SerialDebug)
      Serial.println("SM Sensor 1 2 Read");
    OldSM = SM;
  }
  else if (Dif12 == false && Dif13 == true && Dif23 == false)
  {
    SM = ((Smoke1 + Smoke3) / 2);
    if (SerialDebug)
      Serial.println("SM Sensor 1 3 Read");
    OldSM = SM;
  }
  else if (Dif12 == false && Dif13 == false && Dif23 == true)
  {
    SM = ((Smoke2 + Smoke3) / 2);
    if (SerialDebug)
      Serial.println("SM Sensor 2 3 Read");
    OldSM = SM;
  }
  else
  { // if (Dif12 == false && Dif13 == false && Dif23 == false) (false 2,1 อัน)
    if (SerialDebug)
      Serial.println("SM Sensor Read Failed");
    SM = OldSM;
    SMError = true;
  }
}
void COClean()
{
  if (abs(CODif12) >= DifTresholdCO)
  {
    Dif12 = false;
  }
  if (abs(CODif13) >= DifTresholdCO)
  {
    Dif13 = false;
  }
  if (abs(CODif23) >= DifTresholdCO)
  {
    Dif23 = false;
  }
  if (Dif12 == true && Dif13 == true && Dif23 == true)
  {
    CO = ((CO1 + CO2 + CO3) / 3);
    if (SerialDebug)
      Serial.println("CO All sensor read");
    OldCO = CO;
  }
  else if (Dif12 == true && Dif13 == false && Dif23 == false)
  {
    CO = ((CO1 + CO2) / 2);
    if (SerialDebug)
      Serial.println("CO Sensor 1 2 Read");
    OldCO = CO;
  }
  else if (Dif12 == false && Dif13 == true && Dif23 == false)
  {
    CO = ((CO1 + CO3) / 2);
    if (SerialDebug)
      Serial.println("CO Sensor 1 3 Read");
    OldCO = CO;
  }
  else if (Dif12 == false && Dif13 == false && Dif23 == true)
  {
    CO = ((CO2 + CO3) / 2);
    if (SerialDebug)
      Serial.println("CO Sensor 2 3 Read");
    OldCO = CO;
  }
  else
  { // if (Dif12 == false && Dif13 == false && Dif23 == false) (false 2,1 อัน)
    if (SerialDebug)
      Serial.println("CO Sensor Read Failed");
    CO = OldCO;
    COError = true;
  }
}
void ClearFdictCheck()
{
  if (d.count() > 0)
  {
    if (!FdictCheck)
    {
      taskClearFdict.enable();
      FdictCheck = true;
      FDFirstRun = true; // tell it to not clear on first run
    }
  }
  else
  {
    if (FdictCheck)
    {
      taskClearFdict.disable();
      FdictCheck = false;
    }
  }
}
void ClearFdict()
{
  if (FDFirstRun)
  {
    FDFirstRun = false;
  }
  else
  {
    String RemoveP = d(0);
    d.remove(d(0));    // delete entry in onfire dict
    p.remove(RemoveP); // delete entry in samsay dict
  }
}

void TempCheckCode()
{
  float temperature = dht.getTemperature();
  float Humid = dht.getHumidity(); // just leave it here.
  if (TempCheckTimes < TempTresh)
  {
    if (SerialDebug)
      Serial.println("Temp = " + String(temperature));
    SumTemp = temperature + SumTemp;

    if (SerialDebug)
      Serial.println("SumTemp = " + String(SumTemp));
    TempCheckTimes++;
  }
  else
  {
    FinalTemp = SumTemp / TempTresh;

    if (SerialDebug)
      Serial.println("FinalTemp = " + String(FinalTemp));
    TempCheckTimes = 0;
    if (FinalTemp >= 40)
    { // Sensor is hot enough
      if (SysOn == false)
      {

        if (SerialDebug)
          Serial.println("Sensor Heatup Complete : System ON ");
        if (!Sensorcalib)
        {
          CalibrateSensor();
          Sensorcalib = true;
        }
        taskSendMessage.enable();
        taskFiredetect.enable();
        taskSensorRead.enable();
        taskESPReset.enable();
        SysOn = true;
      }
    }
    else
    {
      if (SerialDebug)
        Serial.println("Sensor Heatup Incomplete : System OFF ");
      msg = ""; // reset msg string
      doc["Room"] = Room;
      RoomStr = String(Room);
      Roomint = RoomStr.toInt();
      if (ID < 100)
      {
        MSG_ID = String((Roomint * 100) + ID);
        ID = ID + 1;
      }
      else
      {
        ID = 0;
        MSG_ID = String((Roomint * 100) + ID);
        ID = ID + 1;
      }
      doc["MSG_ID"] = MSG_ID;
      if (s.count() >= 99)
      {
        s.remove(s(0)); // remove oldest input data to prevent overflow
        s(MSG_ID, "0"); // MSGID for reference with empty value(value not used)
      }
      else
      {
        s(MSG_ID, "0"); // Save sent msgid to dictionary
      }
      doc["status"] = "0";
      doc["ERROR"] = "4";
      serializeJson(doc, msg);
      mesh.sendBroadcast(msg);
      // Serial.println(msg);
      taskSendMessage.disable();
      taskFiredetect.disable();
      taskSensorRead.disable();
      taskESPReset.disable();
      SysOn = false;
    }
    FinalTemp = 0; // reset FinalTemp
    SumTemp = 0;   // reset sumTemp
  }
}

//---------------------------Extra MQ2 code--------------------------------------------------
void SensorRead()
{
  STR_A1 = analogRead(Sen1Pin);
  STR_A2 = analogRead(Sen2Pin);
  STR_A3 = analogRead(Sen3Pin);
}
float MQRead(int analogValue)
{
  float rs = 0;
  rs = MQResistanceCalculation(analogValue);
  return rs;
}
void ReadSensor()
{
  if (SerialDebug)
  {
    Serial.println("Sen1 = " + String(STR_A1) + ": Sen2 = " + String(STR_A2) + ": Sen3 = " + String(STR_A3));
  }
  CO1 = MQGetGasPercentage(MQRead(STR_A1) / Ro1, GAS_CO);
  Smoke1 = MQGetGasPercentage(MQRead(STR_A1) / Ro1, GAS_SMOKE);
  CO2 = MQGetGasPercentage(MQRead(STR_A2) / Ro2, GAS_CO);
  Smoke2 = MQGetGasPercentage(MQRead(STR_A2) / Ro2, GAS_SMOKE);
  CO3 = MQGetGasPercentage(MQRead(STR_A3) / Ro3, GAS_CO);
  Smoke3 = MQGetGasPercentage(MQRead(STR_A3) / Ro3, GAS_SMOKE);
}
void CalibrateSensor()
{
  Ro1 = MQCalibration(Sen1Pin);
  Ro2 = MQCalibration(Sen2Pin);
  Ro3 = MQCalibration(Sen3Pin);
  int SavedRo1 = (EEPROM.read(1)); // Read Saved RO from rom
  int SavedRo2 = (EEPROM.read(5));
  int SavedRo3 = (EEPROM.read(10));
  int dif = Ro1 - SavedRo1;
  if (abs(dif) <= RoTresh)
  { // CompareNew Ro1
    {
      Serial.print("Ro1=");
      Serial.println(Ro1);
    }
  }
  else
  {
    Serial.print("New Ro1 Unreliable = ");
    Serial.println(Ro1);
    Serial.print("Old Ro1 =");
    Serial.println(SavedRo1);
    Ro1 = SavedRo1;
  }
  dif = Ro2 - SavedRo2;
  if (abs(dif) <= RoTresh)
  { // CompareNew Ro2

    Serial.print("Ro2=");
    Serial.println(Ro2);
  }
  else
  {
    Serial.print("New Ro2 Unreliable = ");
    Serial.println(Ro2);
    Serial.print("Old Ro2 =");
    Serial.println(SavedRo2);

    Ro2 = SavedRo2;
  }
  dif = Ro3 - SavedRo3;
  if (abs(dif) <= RoTresh)
  { // CompareNew Ro3

    Serial.print("Ro3 =");
    Serial.println(Ro3);
  }
  else
  {

    Serial.print("New Ro3 Unreliable = ");
    Serial.println(Ro3);
    Serial.print("Old Ro3 =");
    Serial.println(SavedRo3);

    Ro3 = SavedRo3;
  }
}